# Задача на программирование: небольшое число Фибоначчи
# Дано целое число 1≤n≤40, необходимо вычислить n-е число Фибоначчи (напомним, что F0=0, F1=1 и Fn=Fn−1+Fn−2 при n≥2).

def fib(n):
    if n == 0:
        return 0
    if n == 1:
        return 1
    s0 = 0
    s1 = 1
    for i in range(n-1):
        s = s0 + s1
        s0 = s1
        s1 = s
    return s

print(fib(10))