# Задача на программирование "наибольший общий делитель".
# По данным двум числам 1≤a,b≤2⋅10^9 найдите их наибольший общий делитель.


def gcd(a, b):
    while True:
        if a == 0:
            return b
        if b == 0:
            return a
        if a >= b:
            a = a % b
        else:
            b = b % a



print(gcd(14159572, 63967072))